# 09 Mengenal Categorical Encoding: Label Encoding & One Hot Encoding

## Apa itu Categorical Encoding?
Categorical Encoding adalah proses konversi nilai categorical menjadi nilai numerical.
Terdapat banyak jenis Categorical Encoding, dua di antaranya adalah:
- Label Encoding
- One Hot Encoding

Referensi: https://en.wikipedia.org/wiki/One-hot

## Label Encoding
Pada Label Encoding, setiap kategori pada suatu feature akan diurutkan secara alfabet dan direpresentasikan dengan sebuah nilai integer.

## Dataset

In [1]:
import pandas as pd

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000